Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/atdf/PIC32MZ2064DAA176.atdf
         <register caption="" name="SRCON1H" offset="0x7d0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SR1H0" />
            <bitfield mask="0x00000002" name="SR1H1" />
            <bitfield mask="0x00000004" name="SR1H2" />
            <bitfield mask="0x00000008" name="SR1H3" />
            <bitfield mask="0x00000010" name="SR1H4" />
            <bitfield mask="0x00000020" name="SR1H5" />
            <bitfield mask="0x00000040" name="SR1H6" />
            <bitfield mask="0x00000080" name="SR1H7" />
            <bitfield mask="0x00000100" name="SR1H8" />
            <bitfield mask="0x00000200" name="SR1H9" />
            <bitfield mask="0x00000400" name="SR1H10" />
            <bitfield mask="0x00000800" name="SR1H11" />
            <bitfield mask="0x00001000" name="SR1H12" />
            <bitfield mask="0x00002000" name="SR1H13" />
            <bitfield mask="0x00004000" name="SR1H14" />
            <bitfield mask="0x00008000" name="SR1H15" />
         </register>
         <register caption="" name="SRCON1J" offset="0x8d0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SR1J0" />
            <bitfield mask="0x00000002" name="SR1J1" />
            <bitfield mask="0x00000004" name="SR1J2" />
            <bitfield mask="0x00000008" name="SR1J3" />
            <bitfield mask="0x00000010" name="SR1J4" />
            <bitfield mask="0x00000020" name="SR1J5" />
            <bitfield mask="0x00000040" name="SR1J6" />
            <bitfield mask="0x00000080" name="SR1J7" />
            <bitfield mask="0x00000100" name="SR1J8" />
            <bitfield mask="0x00000200" name="SR1J9" />
            <bitfield mask="0x00000400" name="SR1J10" />
            <bitfield mask="0x00000800" name="SR1J11" />
            <bitfield mask="0x00001000" name="SR1J12" />
            <bitfield mask="0x00002000" name="SR1J13" />
            <bitfield mask="0x00004000" name="SR1J14" />
            <bitfield mask="0x00008000" name="SR1J15" />
         </register>
         <register caption="" name="SRCON1K" offset="0x9d0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SR1K0" />
            <bitfield mask="0x00000002" name="SR1K1" />
            <bitfield mask="0x00000004" name="SR1K2" />
            <bitfield mask="0x00000008" name="SR1K3" />
            <bitfield mask="0x00000010" name="SR1K4" />
            <bitfield mask="0x00000020" name="SR1K5" />
            <bitfield mask="0x00000040" name="SR1K6" />
            <bitfield mask="0x00000080" name="SR1K7" />
         </register>
      </register-group>
      <value-group caption="Change Notification Style bit" name="CNCONA__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONA__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONB__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONB__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONC__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONC__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCOND__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCOND__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONE__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONE__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONF__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONF__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONG__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONG__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
