Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/atdf/PIC32MZ2064DAA176.atdf
      <value-group caption="Soft Connect/Disconnect Feature Selection bit" name="USBCSR0__SOFTCONN">
         <value caption="The USB D+/D- lines are enabled and active" name="" value="0x1" />
         <value caption="The USB D+/D- lines are disabled and are tri-stated" name="" value="0x0" />
      </value-group>
      <value-group caption="ISO Update bit (" name="USBCSR0__ISOUPD">
         <value caption="USB module will wait for a SOF token from the time TXPKTRDY is set before sending the packet" name="" value="0x1" />
         <value caption="No change in behavior" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint 0 Interrupt bit" name="USBCSR0__EP0IF">
         <value caption="Endpoint 0 has an interrupt to be serviced" name="" value="0x1" />
         <value caption="No interrupt event" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint 1 TX Interrupt Flag bit" name="USBCSR0__EP1TXIF">
         <value caption="Endpoint has a transmit interrupt to be serviced" name="" value="0x1" />
         <value caption="No interrupt event" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint 2 TX Interrupt Flag bit" name="USBCSR0__EP2TXIF">
         <value caption="Endpoint has a transmit interrupt to be serviced" name="" value="0x1" />
         <value caption="No interrupt event" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint 3 TX Interrupt Flag bit" name="USBCSR0__EP3TXIF">
         <value caption="Endpoint has a transmit interrupt to be serviced" name="" value="0x1" />
         <value caption="No interrupt event" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint 4 TX Interrupt Flag bit" name="USBCSR0__EP4TXIF">
         <value caption="Endpoint has a transmit interrupt to be serviced" name="" value="0x1" />
         <value caption="No interrupt event" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint 5 TX Interrupt Flag bit" name="USBCSR0__EP5TXIF">
         <value caption="Endpoint has a transmit interrupt to be serviced" name="" value="0x1" />
         <value caption="No interrupt event" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint 6 TX Interrupt Flag bit" name="USBCSR0__EP6TXIF">
         <value caption="Endpoint has a transmit interrupt to be serviced" name="" value="0x1" />
         <value caption="No interrupt event" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint 7 TX Interrupt Flag bit" name="USBCSR0__EP7TXIF">
         <value caption="Endpoint has a transmit interrupt to be serviced" name="" value="0x1" />
         <value caption="No interrupt event" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint 1 RX Interrupt bit" name="USBCSR1__EP1RXIF">
         <value caption="Endpoint has a receive event to be serviced" name="" value="0x1" />
         <value caption="No interrupt event" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint 2 RX Interrupt bit" name="USBCSR1__EP2RXIF">
         <value caption="Endpoint has a receive event to be serviced" name="" value="0x1" />
         <value caption="No interrupt event" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint 3 RX Interrupt bit" name="USBCSR1__EP3RXIF">
         <value caption="Endpoint has a receive event to be serviced" name="" value="0x1" />
         <value caption="No interrupt event" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint 4 RX Interrupt bit" name="USBCSR1__EP4RXIF">
         <value caption="Endpoint has a receive event to be serviced" name="" value="0x1" />
         <value caption="No interrupt event" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint 5 RX Interrupt bit" name="USBCSR1__EP5RXIF">
         <value caption="Endpoint has a receive event to be serviced" name="" value="0x1" />
         <value caption="No interrupt event" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint 6 RX Interrupt bit" name="USBCSR1__EP6RXIF">
         <value caption="Endpoint has a receive event to be serviced" name="" value="0x1" />
         <value caption="No interrupt event" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint 7 RX Interrupt bit" name="USBCSR1__EP7RXIF">
         <value caption="Endpoint has a receive event to be serviced" name="" value="0x1" />
         <value caption="No interrupt event" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint 0 Interrupt Enable bit" name="USBCSR1__EP0IE">
         <value caption="Endpoint 0 interrupt events are enabled" name="" value="0x1" />
         <value caption="Endpoint 0 interrupt events are not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint 1 Transmit Interrupt Enable bits" name="USBCSR1__EP1TXIE">
         <value caption="Endpoint Transmit interrupt events are enabled" name="" value="0x1" />
         <value caption="Endpoint Transmit interrupt events are not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint 2 Transmit Interrupt Enable bits" name="USBCSR1__EP2TXIE">
         <value caption="Endpoint Transmit interrupt events are enabled" name="" value="0x1" />
         <value caption="Endpoint Transmit interrupt events are not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint 3 Transmit Interrupt Enable bits" name="USBCSR1__EP3TXIE">
         <value caption="Endpoint Transmit interrupt events are enabled" name="" value="0x1" />
         <value caption="Endpoint Transmit interrupt events are not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint 4 Transmit Interrupt Enable bits" name="USBCSR1__EP4TXIE">
         <value caption="Endpoint Transmit interrupt events are enabled" name="" value="0x1" />
         <value caption="Endpoint Transmit interrupt events are not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint 5 Transmit Interrupt Enable bits" name="USBCSR1__EP5TXIE">
         <value caption="Endpoint Transmit interrupt events are enabled" name="" value="0x1" />
         <value caption="Endpoint Transmit interrupt events are not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint 6 Transmit Interrupt Enable bits" name="USBCSR1__EP6TXIE">
         <value caption="Endpoint Transmit interrupt events are enabled" name="" value="0x1" />
         <value caption="Endpoint Transmit interrupt events are not enabled" name="" value="0x0" />
      </value-group>
